Revit 2027 API
ColorWithTransparency.GetRed Method
 get red
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public uint GetRed()
Public Function GetRed As UInteger
public:
unsigned int GetRed()
member GetRed : unit -> uint32
Return Value
UInt32
 red
See Also
Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace